Revit 2024 API
CableTray Class
 This class represents a cable tray in Autodesk Revit.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class CableTray : CableTrayConduitBase
Visual Basic
Public Class CableTray _
	Inherits CableTrayConduitBase
Visual C++
public ref class CableTray : public CableTrayConduitBase
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.HostObject
 Autodesk.Revit.DB.MEPCurve
 Autodesk.Revit.DB.Electrical.CableTrayConduitBase
 Autodesk.Revit.DB.Electrical.CableTray
See Also
CableTray Members
Autodesk.Revit.DB.Electrical Namespace